In [ ]:
#pandas library
#useful for data manipulation
#used for only structured data

In [5]:
import pandas as pd

In [68]:
data=pd.read_csv(r"C:\Users\Chaitanya\OneDrive\Desktop\NTIN SIR\traffic.csv",sep='$')

In [69]:
data

    nitin  45  m  34000   delhi
0    neha  65  f  76000  mumbai
1    aman  75  m  44000   delhi
2    ravi  47  m  77000    pune
3  vishal  91  m  87000   delhi
4  shruti  54  f  27000   delhi
5   sneha  75  f  19000    pune
6    amit  84  m  75000    pune
7  deepak  38  m  58000    pune
8   rajan  84  m  65000  mumbai
9  shweta  59  f  82000  mumbai

In [70]:
data.shape

(10, 5)

In [71]:
cols=['Names','Age','Gender','Salary','City']
data=pd.read_csv(r"C:\Users\Chaitanya\OneDrive\Desktop\NTIN SIR\traffic.csv",sep='$',names=cols)

In [72]:
data

     Names  Age Gender  Salary    City
0    nitin   45      m   34000   delhi
1     neha   65      f   76000  mumbai
2     aman   75      m   44000   delhi
3     ravi   47      m   77000    pune
4   vishal   91      m   87000   delhi
5   shruti   54      f   27000   delhi
6    sneha   75      f   19000    pune
7     amit   84      m   75000    pune
8   deepak   38      m   58000    pune
9    rajan   84      m   65000  mumbai
10  shweta   59      f   82000  mumbai

In [73]:
data.shape[0]

11

In [74]:
data.shape[1]

5

In [75]:
data.columns

Index(['Names', 'Age', 'Gender', 'Salary', 'City'], dtype='object')

In [76]:
data.head()

    Names  Age Gender  Salary    City
0   nitin   45      m   34000   delhi
1    neha   65      f   76000  mumbai
2    aman   75      m   44000   delhi
3    ravi   47      m   77000    pune
4  vishal   91      m   87000   delhi

In [77]:
data.tail()

     Names  Age Gender  Salary    City
6    sneha   75      f   19000    pune
7     amit   84      m   75000    pune
8   deepak   38      m   58000    pune
9    rajan   84      m   65000  mumbai
10  shweta   59      f   82000  mumbai

In [78]:
data.columns

Index(['Names', 'Age', 'Gender', 'Salary', 'City'], dtype='object')

In [79]:
data['Salary']

0     34000
1     76000
2     44000
3     77000
4     87000
5     27000
6     19000
7     75000
8     58000
9     65000
10    82000
Name: Salary, dtype: int64

In [80]:
data['Age'][4]

np.int64(91)

In [81]:
data['Age'][0]

np.int64(45)

In [82]:
data['Names'][2]

'aman'

In [83]:
data['Gender'].unique()

array(['m', 'f'], dtype=object)

In [84]:
len(data['City'].unique())

3

In [85]:
data.head()

    Names  Age Gender  Salary    City
0   nitin   45      m   34000   delhi
1    neha   65      f   76000  mumbai
2    aman   75      m   44000   delhi
3    ravi   47      m   77000    pune
4  vishal   91      m   87000   delhi

In [86]:
data.tail()

     Names  Age Gender  Salary    City
6    sneha   75      f   19000    pune
7     amit   84      m   75000    pune
8   deepak   38      m   58000    pune
9    rajan   84      m   65000  mumbai
10  shweta   59      f   82000  mumbai

In [87]:
data

     Names  Age Gender  Salary    City
0    nitin   45      m   34000   delhi
1     neha   65      f   76000  mumbai
2     aman   75      m   44000   delhi
3     ravi   47      m   77000    pune
4   vishal   91      m   87000   delhi
5   shruti   54      f   27000   delhi
6    sneha   75      f   19000    pune
7     amit   84      m   75000    pune
8   deepak   38      m   58000    pune
9    rajan   84      m   65000  mumbai
10  shweta   59      f   82000  mumbai

In [90]:
data['Age'].max()

91

In [91]:
data['Age'].mean()

np.float64(65.18181818181819)

In [92]:
data['Age'].sum()

np.int64(717)

In [93]:
data.columns=['name','age','gen','sal','state']

In [94]:
data

      name  age gen    sal   state
0    nitin   45   m  34000   delhi
1     neha   65   f  76000  mumbai
2     aman   75   m  44000   delhi
3     ravi   47   m  77000    pune
4   vishal   91   m  87000   delhi
5   shruti   54   f  27000   delhi
6    sneha   75   f  19000    pune
7     amit   84   m  75000    pune
8   deepak   38   m  58000    pune
9    rajan   84   m  65000  mumbai
10  shweta   59   f  82000  mumbai

In [95]:
axis=0 row
axis=1 col

SyntaxError: invalid syntax (2907020846.py, line 1)

In [96]:
data.drop(3,axis=0)

      name  age gen    sal   state
0    nitin   45   m  34000   delhi
1     neha   65   f  76000  mumbai
2     aman   75   m  44000   delhi
4   vishal   91   m  87000   delhi
5   shruti   54   f  27000   delhi
6    sneha   75   f  19000    pune
7     amit   84   m  75000    pune
8   deepak   38   m  58000    pune
9    rajan   84   m  65000  mumbai
10  shweta   59   f  82000  mumbai

In [97]:
data=data.drop('gen',axis=1)

In [98]:
data

      name  age    sal   state
0    nitin   45  34000   delhi
1     neha   65  76000  mumbai
2     aman   75  44000   delhi
3     ravi   47  77000    pune
4   vishal   91  87000   delhi
5   shruti   54  27000   delhi
6    sneha   75  19000    pune
7     amit   84  75000    pune
8   deepak   38  58000    pune
9    rajan   84  65000  mumbai
10  shweta   59  82000  mumbai

In [99]:
data.reset_index(drop=True)

      name  age    sal   state
0    nitin   45  34000   delhi
1     neha   65  76000  mumbai
2     aman   75  44000   delhi
3     ravi   47  77000    pune
4   vishal   91  87000   delhi
5   shruti   54  27000   delhi
6    sneha   75  19000    pune
7     amit   84  75000    pune
8   deepak   38  58000    pune
9    rajan   84  65000  mumbai
10  shweta   59  82000  mumbai

In [100]:
data

      name  age    sal   state
0    nitin   45  34000   delhi
1     neha   65  76000  mumbai
2     aman   75  44000   delhi
3     ravi   47  77000    pune
4   vishal   91  87000   delhi
5   shruti   54  27000   delhi
6    sneha   75  19000    pune
7     amit   84  75000    pune
8   deepak   38  58000    pune
9    rajan   84  65000  mumbai
10  shweta   59  82000  mumbai

In [103]:
data.sort_values('age')

      name  age    sal   state
8   deepak   38  58000    pune
0    nitin   45  34000   delhi
3     ravi   47  77000    pune
5   shruti   54  27000   delhi
10  shweta   59  82000  mumbai
1     neha   65  76000  mumbai
2     aman   75  44000   delhi
6    sneha   75  19000    pune
7     amit   84  75000    pune
9    rajan   84  65000  mumbai
4   vishal   91  87000   delhi

In [104]:
data.sort_values('age',ascending=False)

      name  age    sal   state
4   vishal   91  87000   delhi
7     amit   84  75000    pune
9    rajan   84  65000  mumbai
2     aman   75  44000   delhi
6    sneha   75  19000    pune
1     neha   65  76000  mumbai
10  shweta   59  82000  mumbai
5   shruti   54  27000   delhi
3     ravi   47  77000    pune
0    nitin   45  34000   delhi
8   deepak   38  58000    pune

In [133]:
data = pd.read_csv('new_file.csv') # No sep needed, comma is default

FileNotFoundError: [Errno 2] No such file or directory: 'new_file.csv'

In [136]:
import pandas as pd
import os

# This finds your desktop path automatically
desktop = os.path.join(os.path.join(os.environ['USERPROFILE']), 'Desktop')
file_path = os.path.join(desktop, 'traffic.csv')

# Now read it using your $ separator
data = pd.read_csv(file_path, sep='$')
print(data.head())

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\Chaitanya\\Desktop\\traffic.csv'

In [132]:
data

                         0
0       name,age,sal,state
1     nitin,45,34000,delhi
2     neha,65,76000,mumbai
3      aman,75,44000,delhi
4       ravi,47,77000,pune
5    vishal,91,87000,delhi
6    shruti,54,27000,delhi
7      sneha,75,19000,pune
8       amit,84,75000,pune
9     deepak,38,58000,pune
10   rajan,84,65000,mumbai
11  shweta,59,82000,mumbai